Revit 2024 API
CableTraySizes.Contains Method
 Checks whether a cable tray size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool Contains(
	double nominalDiameter
)
Visual Basic
Public Function Contains ( _
	nominalDiameter As Double _
) As Boolean
Visual C++
public:
bool Contains(
	double nominalDiameter
)
Parameters
nominalDiameter
Type: System.Double
 Nominal diameter.
Return Value
 True if a cable tray size with the nominal diameter exists.
See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace